{
    "birth": "In the aftermath of the 1914 – 1918 war, the G.A.A. started to gain strength in most parts of Ireland and in Westmeath it was no different. The people of Rosemount got together and discussed the formation of a GAA club. One major influence in the formation of the Rosemount club was the arrival to our National School in 1916 of a young Kerry teacher by the name of Ben Hickey who had played football with his native County. In early 1924, it was decided to affiliate a team to Westmeath County Board. At this time one of our founder members Johnny Smyth cycled to a meeting of Westmeath GAA in Mullingar and submitted our application for affiliation that was accepted – so Rosemount G.A.A. Club formally came into existence in 1924.",
    "championshipSuccess": {
        "para1": "It all started to come together for Rosemount when in 1928 the club won its first Junior Championship. They contested their first Senior Championship in 1932 and after a second replay Rosemount were declared Senior Champions for the very first time. They went on to win further Senior Championships in 1934 – 1939 – 1940 – 1941 and a further three in a row in 1951 – 1952 – 1953. Sadly this was to be their last win until 1989 when the club won its last Senior Championship. During all this time they retained senior status until 2000 when they were relegated to intermediate grade. This situation is unique in County Westmeath.",
        "para2": "After 16 years in the intermediate grade Rosemount finally gained promotion back to the senior ranks in 2016 when they won their first intermediate championship."
    },
    
    "park": {
        "para1": "In 1935, Rosemount G.A.A. availed of the opportunity to acquire land. They applied to the Irish Land Commission and were given a site of approximately six acres. Long hours of hard work by many willing volunteers led to its eventual development.",
        "para2": "The park was officially opened in 1943. It was named after a noted Irish Scholar Fr. O’Growney. Over the years with the aid of loans and grants the pitch was greatly improved by drainage and leveling.",
        "para3": "In 1979, a new community centre was built in the parish on the grounds of the football pitch and for the first time the footballers had their own dressing rooms. At that time, it could compete with any club grounds in the county – but with the growing number of young people in the parish there is more demands on the present playing pitch and this further development is necessary",
        "para4": "In 2004 the club embarked on a very ambitious 5 year plan. In phase 1, a 3 Acre site was purchased where we now have a second playing pitch where floodlighting was also installed which has enabled training under lights. 2 additional dressing rooms were also provided in 2005.In 2007 work commenced which will have all weather “Astro Turf” playing pith available by end of November."
    },

    "rollOfHonour": {
        "senior": "9 (1932, 1934, 1939, 1940, 1941, 1951, 1952, 1953, 1989)",
        "intermediate": "1 (2016)",
        "junior": "2 (1928, 2007)"
    }
}